'''
InfHw24_4
https://education.yandex.ru/ege/inf/task/98ae80c8-1e05-4cad-b4cc-4adc1edcc487
Текстовый файл состоит из символов P, Q, R и S.
В прилагаемом файле определите максимальное количество символов в непрерывной подпоследовательности, которая состоит из идущих подряд групп символов SQRP.
При этом в начале и в конце искомой последовательности группа символов SQRP может быть неполной.
Искомая последовательность должна содержать не менее одной полной группы символов SQRP.
Например, условию задачи удовлетворяют RPSQRPSQRPS, или PSQRPSQRPSQ, или SQRPSQRPSQR и т. п.
'''
print(len("PSQRPSQRPSQRPSQRPSQRPSQRPSQRPSQRPSQRPSQRPSQRPSQRPSQR"))